       IDENTIFICATION DIVISION.                                      
       PROGRAM-ID. T04TSRAM.                                         
       DATA DIVISION.                                                
       WORKING-STORAGE SECTION.                                      
       01 WS-MULT1   PIC 9(2).                                       
       01 WS-MULT2   PIC 9(1).                                       
       01 WS-VALOR-RANDOM     COMP-2.                                
       01 WS-ID-RANDOM        PIC 9(01).                             
       01 WS-INDEX            PIC 9(02).
       01 WS-LETRA-S          PIC X(1).                             
       01 WS-SENHA.                                                  
           05 WS-LETRA-1       PIC X(1).                              
           05 WS-LETRA-2       PIC X(1).                              
           05 WS-LETRA-3       PIC X(1).                              
           05 WS-LETRA-4       PIC X(1).                              
           05 WS-LETRA-5       PIC X(1).                              
       PROCEDURE DIVISION.                                           
       MAIN-PARA.                                                    
           DISPLAY '=== TESTE DA FUNCTION RANDOM ==='.               
           PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 5   
               ACCEPT WS-MULT1 FROM TIME                              
               COMPUTE WS-VALOR-RANDOM = WS-MULT1 * FUNCTION RANDOM   
               COMPUTE WS-ID-RANDOM = WS-VALOR-RANDOM + 1             
               COMPUTE WS-MULT2 = (FUNCTION RANDOM * 10) + 1          
               IF WS-ID-RANDOM > 5                                    
                   COMPUTE WS-ID-RANDOM = WS-ID-RANDOM / WS-MULT2     
               END-IF                                                 
               EVALUATE WS-ID-RANDOM                                  
               WHEN 1                                             
                   MOVE 'S' TO WS-LETRA-S                        
               WHEN 2                                             
                   MOVE 'E' TO WS-LETRA-S                        
               WHEN 3                                             
                   MOVE 'N' TO WS-LETRA-S                        
               WHEN 4                                             
                   MOVE 'H' TO WS-LETRA-S                        
               WHEN 5                                                           
                   MOVE 'A' TO WS-LETRA-S          
               END-EVALUATE
               EVALUATE WS-INDEX                                  
               WHEN 1                                             
                   MOVE WS-LETRA-S TO WS-LETRA-1                 
               WHEN 2                                             
                   MOVE WS-LETRA-S TO WS-LETRA-2                 
               WHEN 3                                             
                   MOVE WS-LETRA-S TO WS-LETRA-3                 
               WHEN 4                                             
                   MOVE WS-LETRA-S TO WS-LETRA-4                 
               WHEN 5                                             
                   MOVE WS-LETRA-S TO WS-LETRA-5                 
               END-EVALUATE                             
           DISPLAY 'RANDOM FLOAT: ' WS-VALOR-RANDOM 
           DISPLAY 'RANDOM INT 1-5: ' WS-ID-RANDOM
           DISPLAY 'SENHA GERADA: ' WS-SENHA  
           DISPLAY '-----------------------------'  
           END-PERFORM                                 
           STOP RUN.                                   